// Напишите программу, которая на вход принимает число и выдает его квадрат

Console.Write("Введите число, квадрат которго вам неободимо найти - ");
// int number = int.Parse(Console.ReadLine());
string number = Console.ReadLine();
int result = int.Parse(number);
Console.Write("Квадрат введеного числа - ");
// Console.WriteLine(number * number);
Console.WriteLine(result * result);

// int number = Convert.ToInt32(Console.ReadLine());